{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "0151deab-ec4e-4738-b9b0-fec2424b2da3",
   "metadata": {},
   "source": [
    "Querying Knowledge Graphs with Cypher"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "74b00a43-df0b-4ead-8de6-2365e8a26f53",
   "metadata": {},
   "source": [
    "### Import packages and set up Neo4"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "bc780563-88e7-4c75-92c7-eb34def44a9f",
   "metadata": {
    "height": 149
   },
   "outputs": [],
   "source": [
    "from langchain_community.graphs import Neo4jGraph\n",
    "\n",
    "# Warning control\n",
    "import warnings\n",
    "warnings.filterwarnings(\"ignore\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "186948fd-da5e-49d5-abf4-ad21aed3271f",
   "metadata": {
    "height": 98
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "bolt://localhost:7687\n",
      "neo4j\n",
      "neo4j\n"
     ]
    }
   ],
   "source": [
    "from dotenv import load_dotenv\n",
    "import os\n",
    "\n",
    "load_dotenv('.env', override=True)\n",
    "NEO4J_URI = os.getenv('NEO4J_URI')\n",
    "NEO4J_USERNAME = os.getenv('NEO4J_USERNAME')\n",
    "NEO4J_PASSWORD = os.getenv('NEO4J_PASSWORD')\n",
    "NEO4J_DATABASE = os.getenv('NEO4J_DATABASE')\n",
    "\n",
    "print(NEO4J_URI)\n",
    "print(NEO4J_USERNAME)\n",
    "print(NEO4J_DATABASE)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "1c30485e",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "bolt://localhost:7687\n",
      "neo4j\n",
      "localNeo4jPassword123\n",
      "neo4j\n"
     ]
    }
   ],
   "source": [
    "print(NEO4J_URI)\n",
    "print(NEO4J_USERNAME)\n",
    "print(NEO4J_PASSWORD)\n",
    "print(NEO4J_DATABASE)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "7a8affe7-9424-47d4-97c7-0a675fc2398f",
   "metadata": {},
   "source": [
    "- Initialize a knowledge graph instance using LangChain's Neo4j integration"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "a5c03340-9078-42b2-9e0a-2dc8495b818f",
   "metadata": {
    "height": 64
   },
   "outputs": [],
   "source": [
    "kg = Neo4jGraph(\n",
    "    url=NEO4J_URI,\n",
    "    username=NEO4J_USERNAME,\n",
    "    password=NEO4J_PASSWORD,\n",
    "    database=NEO4J_DATABASE,\n",
    "    refresh_schema=False,\n",
    ")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "a703052f-c74e-4933-8e62-7e3ec9b12986",
   "metadata": {},
   "source": [
    "### Querying the movie knowledge graph \n",
    "- Match all nodes in the graph"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "b12cfece-6188-4fa4-8ba6-f0eff39c6546",
   "metadata": {
    "height": 81,
    "scrolled": true
   },
   "outputs": [],
   "source": [
    "cypher = \"\"\"\n",
    "  MATCH (n) \n",
    "  RETURN count(n)\n",
    "  \"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "edef9911-c436-4159-ae6b-412557448b94",
   "metadata": {
    "height": 47,
    "scrolled": true
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'count(n)': 198}]"
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "result = kg.query(cypher)\n",
    "result"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "id": "751a9532-114d-4f72-8956-da41aa7eae8d",
   "metadata": {
    "height": 81
   },
   "outputs": [],
   "source": [
    "cypher = \"\"\"\n",
    "  MATCH (n) \n",
    "  RETURN count(n) AS numberOfNodes\n",
    "  \"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "id": "4fd44fea-11ab-4828-b475-71bc450ee900",
   "metadata": {
    "height": 47
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'numberOfNodes': 198}]"
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "result = kg.query(cypher)\n",
    "result"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "id": "4ae04daa-bc4c-42ca-864a-79b3915a234e",
   "metadata": {
    "height": 30
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "There are 198 nodes in this graph.\n"
     ]
    }
   ],
   "source": [
    "print(f\"There are {result[0]['numberOfNodes']} nodes in this graph.\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "ef33d57e-7f3a-4d66-b4d0-325973604906",
   "metadata": {},
   "source": [
    "- Match only the `Movie` nodes by specifying the node label"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "id": "7ebd1092-e6d4-4112-aac9-ce2af1eaa737",
   "metadata": {
    "height": 98
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'numberOfMovies': 38}]"
      ]
     },
     "execution_count": 18,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher = \"\"\"\n",
    "  MATCH (n:Movie) \n",
    "  RETURN count(n) AS numberOfMovies\n",
    "  \"\"\"\n",
    "kg.query(cypher)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "78ca792e-831f-4f1a-b728-92928d41e9b6",
   "metadata": {},
   "source": [
    "- Change the variable name in the node pattern match for improved readability"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "id": "26b1ed1f-c780-4de8-8c96-5594bc8b63af",
   "metadata": {
    "height": 98
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'numberOfMovies': 38}]"
      ]
     },
     "execution_count": 19,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher = \"\"\"\n",
    "  MATCH (m:Movie) \n",
    "  RETURN count(m) AS numberOfMovies\n",
    "  \"\"\"\n",
    "kg.query(cypher)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "b0534a64-f4c0-4e22-a79d-cce5ef595aa3",
   "metadata": {},
   "source": [
    "- Match only the `Person` nodes"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "id": "5b7d6465-19a7-4f0c-b2a3-f32fd5991c46",
   "metadata": {
    "height": 98,
    "scrolled": true
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'numberOfPeople': 136}]"
      ]
     },
     "execution_count": 20,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher = \"\"\"\n",
    "  MATCH (people:Person) \n",
    "  RETURN count(people) AS numberOfPeople\n",
    "  \"\"\"\n",
    "kg.query(cypher)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "209a950f-3335-4a47-801c-53a821529cc7",
   "metadata": {},
   "source": [
    "- Match a single person by specifying the value of the `name` property on the `Person` node"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "id": "1c1f5e93-39dc-4585-ba3a-2cd492cbf665",
   "metadata": {
    "height": 98
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'tom': {'born': 1956, 'name': 'Tom Hanks'}}]"
      ]
     },
     "execution_count": 21,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher = \"\"\"\n",
    "  MATCH (tom:Person {name:\"Tom Hanks\"}) \n",
    "  RETURN tom\n",
    "  \"\"\"\n",
    "kg.query(cypher)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "936ee283-90ba-4ada-92b2-dd7c6bccfdc9",
   "metadata": {},
   "source": [
    "- Match a single `Movie` by specifying the value of the `title` property"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "id": "d952bf0c-d2c0-4b64-86b5-29e2521f543e",
   "metadata": {
    "height": 98
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'cloudAtlas': {'taglineEmbedding': [-0.008234365843236446,\n",
       "    -0.010291384533047676,\n",
       "    0.02180314064025879,\n",
       "    -0.012015002779662609,\n",
       "    -0.026546236127614975,\n",
       "    -0.005642647854983807,\n",
       "    -0.002201701980084181,\n",
       "    -0.01689649000763893,\n",
       "    0.01855720393359661,\n",
       "    -0.029917985200881958,\n",
       "    -0.01368829607963562,\n",
       "    0.006485585123300552,\n",
       "    0.009593130089342594,\n",
       "    -0.005312392488121986,\n",
       "    -0.012335821986198425,\n",
       "    -0.017173275351524353,\n",
       "    0.029389576986432076,\n",
       "    -0.00304149417206645,\n",
       "    0.02321222983300686,\n",
       "    -0.016430987045168877,\n",
       "    0.00015746100689284503,\n",
       "    0.007718538399785757,\n",
       "    0.005346990656107664,\n",
       "    -0.03537820652127266,\n",
       "    -0.002492641331627965,\n",
       "    0.011939515359699726,\n",
       "    -0.0015010889619588852,\n",
       "    -0.023224812000989914,\n",
       "    0.011775961145758629,\n",
       "    -0.02946506440639496,\n",
       "    0.015437076799571514,\n",
       "    -0.004802855663001537,\n",
       "    -0.023161904886364937,\n",
       "    -0.020519863814115524,\n",
       "    -0.012971170246601105,\n",
       "    0.009775557555258274,\n",
       "    0.0029219731222838163,\n",
       "    -0.01594032347202301,\n",
       "    -0.013650552369654179,\n",
       "    -0.0021592406556010246,\n",
       "    0.0054728020913898945,\n",
       "    0.0039033032953739166,\n",
       "    -0.0024533250834792852,\n",
       "    0.019538532942533493,\n",
       "    -0.02574104256927967,\n",
       "    0.005397315137088299,\n",
       "    0.002107343403622508,\n",
       "    -0.02391677536070347,\n",
       "    -0.023879030719399452,\n",
       "    0.01732425019145012,\n",
       "    0.001641840673983097,\n",
       "    0.007127224002033472,\n",
       "    -0.03117610141634941,\n",
       "    -0.04244881495833397,\n",
       "    0.0028810843359678984,\n",
       "    0.01709778979420662,\n",
       "    -0.006145894061774015,\n",
       "    0.013008913956582546,\n",
       "    0.0035290138330310583,\n",
       "    -0.02025565877556801,\n",
       "    0.004494617693126202,\n",
       "    -0.013713458552956581,\n",
       "    -0.024822618812322617,\n",
       "    0.007454334292560816,\n",
       "    -0.004969555884599686,\n",
       "    0.005035607144236565,\n",
       "    -0.0007407154771499336,\n",
       "    0.013512159697711468,\n",
       "    0.019890805706381798,\n",
       "    0.02898697927594185,\n",
       "    0.04526699334383011,\n",
       "    0.028735356405377388,\n",
       "    0.0077311196364462376,\n",
       "    -0.0028574946336448193,\n",
       "    -0.015525144524872303,\n",
       "    0.00043640879448503256,\n",
       "    -0.02855922095477581,\n",
       "    -0.006356628146022558,\n",
       "    0.00575902359560132,\n",
       "    0.0164813119918108,\n",
       "    0.017588453367352486,\n",
       "    -0.016770679503679276,\n",
       "    -0.0007646983140148222,\n",
       "    0.0329626239836216,\n",
       "    0.002774144522845745,\n",
       "    -0.03399427980184555,\n",
       "    -0.017223600298166275,\n",
       "    0.018594946712255478,\n",
       "    0.0053910245187580585,\n",
       "    -0.02599266543984413,\n",
       "    0.0060829883441329,\n",
       "    0.016682611778378487,\n",
       "    -0.02292286418378353,\n",
       "    -0.00024946071789599955,\n",
       "    0.002978588454425335,\n",
       "    0.0018793100025504827,\n",
       "    -0.006479294504970312,\n",
       "    0.005510545801371336,\n",
       "    0.01991596817970276,\n",
       "    -0.017928145825862885,\n",
       "    0.0030100413132458925,\n",
       "    0.028836006298661232,\n",
       "    -0.03442203998565674,\n",
       "    -0.008228074759244919,\n",
       "    -0.002110488712787628,\n",
       "    -0.009347798302769661,\n",
       "    -0.0032931172754615545,\n",
       "    0.0043404982425272465,\n",
       "    0.005123675335198641,\n",
       "    -0.011763379909098148,\n",
       "    -0.0008853987674228847,\n",
       "    0.020658256486058235,\n",
       "    0.011115450412034988,\n",
       "    -0.04488955810666084,\n",
       "    0.014141217805445194,\n",
       "    0.008762774057686329,\n",
       "    -0.0008971935603767633,\n",
       "    0.0015065933112055063,\n",
       "    -0.013663133606314659,\n",
       "    -0.008907457813620567,\n",
       "    0.021387962624430656,\n",
       "    0.0010363726178184152,\n",
       "    -0.012486795894801617,\n",
       "    -0.003953627776354551,\n",
       "    0.015474820509552956,\n",
       "    0.02332546003162861,\n",
       "    -0.044713422656059265,\n",
       "    0.0005850236630067229,\n",
       "    -0.01499673631042242,\n",
       "    -0.004758821800351143,\n",
       "    0.022004438564181328,\n",
       "    0.013260536827147007,\n",
       "    -0.0002931015915237367,\n",
       "    0.03311359882354736,\n",
       "    0.001092201448045671,\n",
       "    0.008228074759244919,\n",
       "    -0.017525548115372658,\n",
       "    0.013185050338506699,\n",
       "    -0.009133918210864067,\n",
       "    -0.00749207753688097,\n",
       "    0.009291182272136211,\n",
       "    -0.007347394246608019,\n",
       "    -0.016682611778378487,\n",
       "    -0.00563321216031909,\n",
       "    0.01721101999282837,\n",
       "    0.02833276055753231,\n",
       "    0.005340700037777424,\n",
       "    0.01497157383710146,\n",
       "    0.019525952637195587,\n",
       "    -0.010467520914971828,\n",
       "    0.015575469471514225,\n",
       "    -0.0007017925381660461,\n",
       "    0.016015809029340744,\n",
       "    -0.022948026657104492,\n",
       "    0.014795437455177307,\n",
       "    0.016342919319868088,\n",
       "    -0.0010175008792430162,\n",
       "    0.0005209384253248572,\n",
       "    -0.00812742579728365,\n",
       "    0.003645389573648572,\n",
       "    -0.022067345678806305,\n",
       "    0.008599218912422657,\n",
       "    -0.005054478999227285,\n",
       "    -0.01074430625885725,\n",
       "    0.02143828757107258,\n",
       "    0.03492528572678566,\n",
       "    0.011039962992072105,\n",
       "    -0.0042587206698954105,\n",
       "    -0.00914020836353302,\n",
       "    0.00401338841766119,\n",
       "    -0.005828219931572676,\n",
       "    0.024369696155190468,\n",
       "    -0.056061625480651855,\n",
       "    0.012272916734218597,\n",
       "    -0.014682207256555557,\n",
       "    0.003601355478167534,\n",
       "    -0.00627485103905201,\n",
       "    0.029616037383675575,\n",
       "    -0.034573011100292206,\n",
       "    -0.031251586973667145,\n",
       "    -0.007542402017861605,\n",
       "    -0.00035934921470470726,\n",
       "    0.029213441535830498,\n",
       "    0.01757587306201458,\n",
       "    -0.0017110370099544525,\n",
       "    0.0010009880643337965,\n",
       "    0.003642244264483452,\n",
       "    -0.011662730015814304,\n",
       "    0.018381066620349884,\n",
       "    -0.011939515359699726,\n",
       "    -0.005692972335964441,\n",
       "    0.0060798428021371365,\n",
       "    -0.012128232978284359,\n",
       "    -0.011329329572618008,\n",
       "    -0.6852200031280518,\n",
       "    -0.016795841977000237,\n",
       "    0.02858438342809677,\n",
       "    -0.013977662660181522,\n",
       "    0.009416994638741016,\n",
       "    0.0068567292764782906,\n",
       "    0.008920039050281048,\n",
       "    0.01723618246614933,\n",
       "    0.0134744169190526,\n",
       "    -0.0072781979106366634,\n",
       "    -0.0021749672014266253,\n",
       "    0.015273521654307842,\n",
       "    -0.003749184077605605,\n",
       "    -0.002181257586926222,\n",
       "    -0.004950684495270252,\n",
       "    -0.010920442640781403,\n",
       "    0.014782856218516827,\n",
       "    -0.032711002975702286,\n",
       "    -0.00046235742047429085,\n",
       "    0.005007299594581127,\n",
       "    -0.015739023685455322,\n",
       "    -0.0017063190462067723,\n",
       "    0.000526835850905627,\n",
       "    0.007246744818985462,\n",
       "    0.0025791367515921593,\n",
       "    0.011826285161077976,\n",
       "    0.017387155443429947,\n",
       "    -0.022771889343857765,\n",
       "    -0.012247754260897636,\n",
       "    0.009750395081937313,\n",
       "    -0.010052342899143696,\n",
       "    -0.0026845037937164307,\n",
       "    0.019865643233060837,\n",
       "    0.009316344745457172,\n",
       "    0.03988226130604744,\n",
       "    0.006586234550923109,\n",
       "    0.002588572446256876,\n",
       "    0.029817337170243263,\n",
       "    0.007548692636191845,\n",
       "    0.021249569952487946,\n",
       "    0.009008106775581837,\n",
       "    -0.005126820411533117,\n",
       "    0.022344131022691727,\n",
       "    0.01042348612099886,\n",
       "    -0.00457639480009675,\n",
       "    0.0031846046913415194,\n",
       "    0.027678539976477623,\n",
       "    -0.02735142968595028,\n",
       "    0.008146297186613083,\n",
       "    0.004815436899662018,\n",
       "    -0.0005850236630067229,\n",
       "    -0.015437076799571514,\n",
       "    -0.01071914378553629,\n",
       "    0.0322832427918911,\n",
       "    -0.01097076665610075,\n",
       "    0.00111107318662107,\n",
       "    0.012103070504963398,\n",
       "    0.009473609738051891,\n",
       "    -0.005850236862897873,\n",
       "    -0.004724223632365465,\n",
       "    0.007441753055900335,\n",
       "    0.0024234449956566095,\n",
       "    -0.027074644342064857,\n",
       "    0.008165169507265091,\n",
       "    -0.0034346552565693855,\n",
       "    -0.005831365007907152,\n",
       "    -0.03678729757666588,\n",
       "    0.01616678386926651,\n",
       "    0.016607124358415604,\n",
       "    -0.007083190139383078,\n",
       "    0.028005650267004967,\n",
       "    0.017160695046186447,\n",
       "    0.008196622133255005,\n",
       "    0.005919433198869228,\n",
       "    0.01805395632982254,\n",
       "    0.04126618802547455,\n",
       "    0.029112791642546654,\n",
       "    0.011970968917012215,\n",
       "    -0.009995726868510246,\n",
       "    0.012612607330083847,\n",
       "    -0.02207992598414421,\n",
       "    -0.025841690599918365,\n",
       "    -0.0278546754270792,\n",
       "    0.003425219329074025,\n",
       "    0.030370907858014107,\n",
       "    0.010964476503431797,\n",
       "    -0.01737457513809204,\n",
       "    -0.0017645069165155292,\n",
       "    0.01049268338829279,\n",
       "    -0.011140611954033375,\n",
       "    0.01367571484297514,\n",
       "    -0.015927741304039955,\n",
       "    -0.01354990340769291,\n",
       "    -0.002811887999996543,\n",
       "    0.024067748337984085,\n",
       "    0.0011724063660949469,\n",
       "    -0.01850687898695469,\n",
       "    0.020041778683662415,\n",
       "    0.015764186158776283,\n",
       "    -0.00901439692825079,\n",
       "    0.009825881570577621,\n",
       "    -0.01508480403572321,\n",
       "    0.005567160900682211,\n",
       "    0.002896810881793499,\n",
       "    0.016456149518489838,\n",
       "    0.0021356509532779455,\n",
       "    -0.007649342063814402,\n",
       "    0.026244288310408592,\n",
       "    0.03142772242426872,\n",
       "    -0.0063471924513578415,\n",
       "    -0.015751605853438377,\n",
       "    -0.00434364378452301,\n",
       "    -0.006460422649979591,\n",
       "    -3.970926991314627e-05,\n",
       "    -0.016821004450321198,\n",
       "    -0.016229689121246338,\n",
       "    0.02467164397239685,\n",
       "    -0.0043499344028532505,\n",
       "    0.0023149324115365744,\n",
       "    -0.009599421173334122,\n",
       "    0.020796649158000946,\n",
       "    0.012084199115633965,\n",
       "    -0.01280132494866848,\n",
       "    -0.011279004625976086,\n",
       "    0.0007878948235884309,\n",
       "    0.00984475389122963,\n",
       "    -0.013109562918543816,\n",
       "    -0.015424495562911034,\n",
       "    -0.020708579570055008,\n",
       "    0.0009876206750050187,\n",
       "    0.017110370099544525,\n",
       "    -0.001050526392646134,\n",
       "    0.019224004819989204,\n",
       "    0.011121740564703941,\n",
       "    -0.004812291823327541,\n",
       "    -0.0013532604789361358,\n",
       "    -0.0005362717201933265,\n",
       "    -0.004938103258609772,\n",
       "    0.008964072912931442,\n",
       "    -0.02835792303085327,\n",
       "    -0.008322433568537235,\n",
       "    -0.0034378005657345057,\n",
       "    -0.006004355847835541,\n",
       "    0.013361185789108276,\n",
       "    0.0011252269614487886,\n",
       "    -0.03298778831958771,\n",
       "    -0.011052544228732586,\n",
       "    -0.024243885651230812,\n",
       "    -0.02467164397239685,\n",
       "    -0.03935385122895241,\n",
       "    -0.004047986585646868,\n",
       "    -0.014002825133502483,\n",
       "    -0.026319775730371475,\n",
       "    0.020456956699490547,\n",
       "    0.01687132753431797,\n",
       "    0.002635751850903034,\n",
       "    -0.0028024520725011826,\n",
       "    -0.002464333549141884,\n",
       "    -0.017928145825862885,\n",
       "    -0.03016960807144642,\n",
       "    6.757456139894202e-05,\n",
       "    0.014053150080144405,\n",
       "    -0.0186452716588974,\n",
       "    0.0019705232698470354,\n",
       "    -0.00466760853305459,\n",
       "    -0.012008711695671082,\n",
       "    -0.008712449111044407,\n",
       "    0.015588050708174706,\n",
       "    -0.004903505090624094,\n",
       "    -0.006894472520798445,\n",
       "    0.009693779982626438,\n",
       "    -0.03135223686695099,\n",
       "    -0.003227066248655319,\n",
       "    0.0006243397947400808,\n",
       "    -0.0008641680469736457,\n",
       "    0.01901012472808361,\n",
       "    0.0013611236354336143,\n",
       "    -0.0014429012080654502,\n",
       "    0.02492326684296131,\n",
       "    -0.007718538399785757,\n",
       "    -0.004752531182020903,\n",
       "    -0.012015002779662609,\n",
       "    0.00043994723819196224,\n",
       "    -0.0030871008057147264,\n",
       "    0.017361992970108986,\n",
       "    0.0038970126770436764,\n",
       "    0.04808517172932625,\n",
       "    0.0002653837436810136,\n",
       "    -0.01802879385650158,\n",
       "    0.010127829387784004,\n",
       "    -0.0034378005657345057,\n",
       "    0.038598980754613876,\n",
       "    -0.01994113065302372,\n",
       "    -0.009052140638232231,\n",
       "    0.013663133606314659,\n",
       "    0.004428566433489323,\n",
       "    -0.007743700873106718,\n",
       "    -0.005186581052839756,\n",
       "    0.00888858549296856,\n",
       "    0.01732425019145012,\n",
       "    0.011889191344380379,\n",
       "    -0.02275930903851986,\n",
       "    -0.0013052948052063584,\n",
       "    -0.024721968919038773,\n",
       "    -0.00031787072657607496,\n",
       "    -0.008372758515179157,\n",
       "    -0.0068315668031573296,\n",
       "    -0.026470748707652092,\n",
       "    0.007674504071474075,\n",
       "    0.026999156922101974,\n",
       "    0.014040568843483925,\n",
       "    -0.012706966139376163,\n",
       "    -0.008467117324471474,\n",
       "    -0.004400258883833885,\n",
       "    0.005400460679084063,\n",
       "    0.02280963398516178,\n",
       "    -0.00837904866784811,\n",
       "    0.024948429316282272,\n",
       "    -0.018469134345650673,\n",
       "    0.0074480436742305756,\n",
       "    0.0010002017952501774,\n",
       "    -0.011958387680351734,\n",
       "    0.011939515359699726,\n",
       "    -0.005041897762566805,\n",
       "    0.011090287938714027,\n",
       "    0.012084199115633965,\n",
       "    0.013990243896842003,\n",
       "    0.0271752942353487,\n",
       "    -0.004743095487356186,\n",
       "    -0.018494296818971634,\n",
       "    -0.01510996650904417,\n",
       "    0.01734941266477108,\n",
       "    0.0023794109001755714,\n",
       "    0.004928667098283768,\n",
       "    -0.0034944156650453806,\n",
       "    0.008511151187121868,\n",
       "    0.003406347706913948,\n",
       "    -0.005123675335198641,\n",
       "    0.02621912583708763,\n",
       "    -0.00336545892059803,\n",
       "    -0.0011574662057682872,\n",
       "    0.018091700971126556,\n",
       "    0.006359773688018322,\n",
       "    0.006869310513138771,\n",
       "    0.016883909702301025,\n",
       "    0.007322231773287058,\n",
       "    0.030874153599143028,\n",
       "    -0.02214283123612404,\n",
       "    -0.03585629165172577,\n",
       "    0.010863826610147953,\n",
       "    0.005963467061519623,\n",
       "    0.0024171543773263693,\n",
       "    -0.01474511343985796,\n",
       "    0.002646760316565633,\n",
       "    0.019060449674725533,\n",
       "    -0.012342113070189953,\n",
       "    -0.00992653053253889,\n",
       "    0.00368313305079937,\n",
       "    0.026068152859807014,\n",
       "    0.019047867506742477,\n",
       "    0.006705755367875099,\n",
       "    -0.0046644629910588264,\n",
       "    -0.004265011288225651,\n",
       "    0.003749184077605605,\n",
       "    -0.002829187083989382,\n",
       "    0.004651881754398346,\n",
       "    -0.014254448004066944,\n",
       "    0.0036957140546292067,\n",
       "    -0.015449658036231995,\n",
       "    -0.00011794832244049758,\n",
       "    0.0106310760602355,\n",
       "    -0.004104601684957743,\n",
       "    -0.008511151187121868,\n",
       "    -0.03653567284345627,\n",
       "    0.020922459661960602,\n",
       "    0.0073977187275886536,\n",
       "    -0.007976451888680458,\n",
       "    0.008215493522584438,\n",
       "    0.0038215257227420807,\n",
       "    0.009259729646146297,\n",
       "    -0.013172469101846218,\n",
       "    0.0013013632269576192,\n",
       "    -0.007863221690058708,\n",
       "    0.025816529989242554,\n",
       "    -0.015990646556019783,\n",
       "    -0.022973189130425453,\n",
       "    -0.01782749593257904,\n",
       "    0.022318968549370766,\n",
       "    0.008743902668356895,\n",
       "    0.002837050473317504,\n",
       "    0.005906851962208748,\n",
       "    0.004205251112580299,\n",
       "    0.020972784608602524,\n",
       "    -0.013285699300467968,\n",
       "    -0.006473003886640072,\n",
       "    0.005356426350772381,\n",
       "    0.004346788860857487,\n",
       "    -0.012713256292045116,\n",
       "    0.022683821618556976,\n",
       "    -0.009700070135295391,\n",
       "    -0.020683418959379196,\n",
       "    0.011920643970370293,\n",
       "    -0.011738217435777187,\n",
       "    -0.002027138601988554,\n",
       "    0.026495911180973053,\n",
       "    0.017110370099544525,\n",
       "    0.0027426916640251875,\n",
       "    -0.004831163212656975,\n",
       "    -0.004856325685977936,\n",
       "    -0.009171661920845509,\n",
       "    0.0009797574020922184,\n",
       "    -0.010467520914971828,\n",
       "    -0.010945604182779789,\n",
       "    -0.017085207626223564,\n",
       "    0.008605509996414185,\n",
       "    -0.004912940785288811,\n",
       "    -0.026269450783729553,\n",
       "    0.012845358811318874,\n",
       "    0.036485347896814346,\n",
       "    -0.008636962622404099,\n",
       "    -0.014455746859312057,\n",
       "    -0.026319775730371475,\n",
       "    -0.03145288676023483,\n",
       "    0.004110892303287983,\n",
       "    0.0852499008178711,\n",
       "    0.011480303481221199,\n",
       "    -0.017135532572865486,\n",
       "    0.02233154885470867,\n",
       "    -0.006180492229759693,\n",
       "    -0.025049079209566116,\n",
       "    -0.0447889119386673,\n",
       "    -0.022973189130425453,\n",
       "    -0.0021403690334409475,\n",
       "    -0.002354248659685254,\n",
       "    0.014958992600440979,\n",
       "    -0.0019563694950193167,\n",
       "    0.006171056535094976,\n",
       "    -0.0036736971233040094,\n",
       "    -0.012908264994621277,\n",
       "    0.013914757408201694,\n",
       "    -0.008441954851150513,\n",
       "    -0.008171459659934044,\n",
       "    -0.0015844391891732812,\n",
       "    -0.01008379552513361,\n",
       "    -0.02546425722539425,\n",
       "    -0.014090892858803272,\n",
       "    0.0074794963002204895,\n",
       "    0.027502404525876045,\n",
       "    0.006127022206783295,\n",
       "    0.00998314656317234,\n",
       "    0.006123877130448818,\n",
       "    0.01616678386926651,\n",
       "    0.0018195494776591659,\n",
       "    -0.015386751852929592,\n",
       "    0.0031342802103608847,\n",
       "    0.027678539976477623,\n",
       "    -0.0007855358417145908,\n",
       "    0.02196669578552246,\n",
       "    -0.03286197409033775,\n",
       "    0.006293722428381443,\n",
       "    0.002929836278781295,\n",
       "    0.018355904147028923,\n",
       "    0.02262091636657715,\n",
       "    0.007580145727843046,\n",
       "    0.016657449305057526,\n",
       "    -0.004154926165938377,\n",
       "    0.007951289415359497,\n",
       "    -0.027452079579234123,\n",
       "    -0.002832332393154502,\n",
       "    -0.019161097705364227,\n",
       "    -0.00803935807198286,\n",
       "    0.006167910993099213,\n",
       "    0.0193246528506279,\n",
       "    -0.0047745481133461,\n",
       "    0.014279610477387905,\n",
       "    -0.010706562548875809,\n",
       "    -0.00640695309266448,\n",
       "    -0.012751000002026558,\n",
       "    0.010530426166951656,\n",
       "    0.009008106775581837,\n",
       "    -0.006756079848855734,\n",
       "    -0.020570186898112297,\n",
       "    -0.018431391566991806,\n",
       "    -0.02596750296652317,\n",
       "    -0.013008913956582546,\n",
       "    -0.004903505090624094,\n",
       "    0.020545026287436485,\n",
       "    -0.02616880089044571,\n",
       "    -0.0009860480204224586,\n",
       "    -0.014116055332124233,\n",
       "    -0.026093315333127975,\n",
       "    0.0008122707949951291,\n",
       "    -0.009511352516710758,\n",
       "    -0.025363607332110405,\n",
       "    0.009454737417399883,\n",
       "    -0.02157668024301529,\n",
       "    -0.01878366433084011,\n",
       "    -0.002467478858307004,\n",
       "    0.035755641758441925,\n",
       "    0.033843304961919785,\n",
       "    0.0023762655910104513,\n",
       "    -0.007171258330345154,\n",
       "    0.003944192081689835,\n",
       "    0.031226426362991333,\n",
       "    -0.01151804719120264,\n",
       "    -0.013235374353826046,\n",
       "    -0.014178961515426636,\n",
       "    0.0075864363461732864,\n",
       "    -0.017135532572865486,\n",
       "    0.006473003886640072,\n",
       "    0.007460624445229769,\n",
       "    -0.009071012027561665,\n",
       "    -0.013210211880505085,\n",
       "    0.016745517030358315,\n",
       "    0.016405826434493065,\n",
       "    0.00401338841766119,\n",
       "    0.021765397861599922,\n",
       "    -0.017902983352541924,\n",
       "    0.011687892489135265,\n",
       "    0.009177952073514462,\n",
       "    0.01855720393359661,\n",
       "    0.011190936900675297,\n",
       "    -0.005038752220571041,\n",
       "    -0.012908264994621277,\n",
       "    0.019626600667834282,\n",
       "    -0.034069765359163284,\n",
       "    -0.012857940047979355,\n",
       "    -0.005938305053859949,\n",
       "    0.012669222429394722,\n",
       "    -0.008945200592279434,\n",
       "    0.009599421173334122,\n",
       "    0.007190129719674587,\n",
       "    -0.010920442640781403,\n",
       "    -0.014380259439349174,\n",
       "    0.022117670625448227,\n",
       "    -0.04667608439922333,\n",
       "    0.0075298212468624115,\n",
       "    -0.012587444856762886,\n",
       "    -0.019790155813097954,\n",
       "    0.025866853073239326,\n",
       "    0.023652570322155952,\n",
       "    0.02132505737245083,\n",
       "    -0.01867043413221836,\n",
       "    -0.014694788493216038,\n",
       "    -0.013851851224899292,\n",
       "    -0.02974184975028038,\n",
       "    -0.00956167746335268,\n",
       "    0.01229178812354803,\n",
       "    0.008938910439610481,\n",
       "    -0.016632286831736565,\n",
       "    0.030496718361973763,\n",
       "    0.010297674685716629,\n",
       "    -0.004239849280565977,\n",
       "    0.00509851286187768,\n",
       "    -0.008108554407954216,\n",
       "    0.03349103406071663,\n",
       "    -0.0043090456165373325,\n",
       "    -0.025200052186846733,\n",
       "    -0.014128636568784714,\n",
       "    0.010662528686225414,\n",
       "    -0.023841287940740585,\n",
       "    0.004670753609389067,\n",
       "    -0.03970612213015556,\n",
       "    -0.00671833660453558,\n",
       "    -0.01497157383710146,\n",
       "    -0.012423889711499214,\n",
       "    0.002934554358944297,\n",
       "    -0.03326457366347313,\n",
       "    -0.009530224837362766,\n",
       "    -0.03578080236911774,\n",
       "    0.0007234163931570947,\n",
       "    -0.009190533310174942,\n",
       "    0.012235173024237156,\n",
       "    0.03557950630784035,\n",
       "    -0.004466309677809477,\n",
       "    -0.006825276184827089,\n",
       "    -0.023073837161064148,\n",
       "    -0.004261866211891174,\n",
       "    -0.014556395821273327,\n",
       "    -0.025111984461545944,\n",
       "    -0.008725030347704887,\n",
       "    -0.018456554040312767,\n",
       "    0.046625759452581406,\n",
       "    0.03303811326622963,\n",
       "    0.03542853146791458,\n",
       "    0.0028228964656591415,\n",
       "    0.016217108815908432,\n",
       "    0.018934637308120728,\n",
       "    0.005526272114366293,\n",
       "    -0.0080141955986619,\n",
       "    0.0032899719662964344,\n",
       "    -0.0011708337115123868,\n",
       "    -0.008083391934633255,\n",
       "    0.032912299036979675,\n",
       "    -0.0037397481501102448,\n",
       "    0.01150546595454216,\n",
       "    0.013222793117165565,\n",
       "    0.014707369729876518,\n",
       "    0.005692972335964441,\n",
       "    0.025325864553451538,\n",
       "    0.00380579917691648,\n",
       "    -0.004815436899662018,\n",
       "    -0.014606720767915249,\n",
       "    -0.0320567823946476,\n",
       "    -0.0037586200051009655,\n",
       "    0.008309852331876755,\n",
       "    0.005784185603260994,\n",
       "    0.02143828757107258,\n",
       "    -0.009171661920845509,\n",
       "    -0.003239647252485156,\n",
       "    -0.0005354853929020464,\n",
       "    0.013310861773788929,\n",
       "    0.0064132437109947205,\n",
       "    -0.00790096540004015,\n",
       "    0.019525952637195587,\n",
       "    -0.015449658036231995,\n",
       "    0.03827187046408653,\n",
       "    0.001843139179982245,\n",
       "    0.002333804266527295,\n",
       "    -0.017726846039295197,\n",
       "    -0.00791354663670063,\n",
       "    -0.0004434857110027224,\n",
       "    0.003324570134282112,\n",
       "    0.027074644342064857,\n",
       "    -0.012241463176906109,\n",
       "    0.018104281276464462,\n",
       "    -0.023539340123534203,\n",
       "    0.026244288310408592,\n",
       "    -0.008309852331876755,\n",
       "    -0.00174091721419245,\n",
       "    -0.0063880812376737595,\n",
       "    -0.011014800518751144,\n",
       "    -0.001638695364817977,\n",
       "    -0.03890093043446541,\n",
       "    -0.011279004625976086,\n",
       "    -0.027728864923119545,\n",
       "    -0.037416353821754456,\n",
       "    -0.020431794226169586,\n",
       "    0.01982790045440197,\n",
       "    -0.0030131866224110126,\n",
       "    -0.024180978536605835,\n",
       "    0.0243319533765316,\n",
       "    0.0014389695134013891,\n",
       "    -0.022004438564181328,\n",
       "    0.0013115854235365987,\n",
       "    0.014405421912670135,\n",
       "    0.027653377503156662,\n",
       "    -0.006756079848855734,\n",
       "    0.0190981924533844,\n",
       "    0.01943788304924965,\n",
       "    0.006674302741885185,\n",
       "    -0.015449658036231995,\n",
       "    0.005038752220571041,\n",
       "    -0.01712295226752758,\n",
       "    -0.02669721096754074,\n",
       "    0.018443971872329712,\n",
       "    -0.007120933383703232,\n",
       "    -0.012342113070189953,\n",
       "    0.010046051815152168,\n",
       "    0.0008570911595597863,\n",
       "    -0.012335821986198425,\n",
       "    0.006623977795243263,\n",
       "    -0.027955325320363045,\n",
       "    0.01474511343985796,\n",
       "    0.014782856218516827,\n",
       "    0.013839269988238811,\n",
       "    -0.010215897113084793,\n",
       "    -0.015147710219025612,\n",
       "    0.0031908953096717596,\n",
       "    0.00785693060606718,\n",
       "    -0.020041778683662415,\n",
       "    0.00336231361143291,\n",
       "    -0.013260536827147007,\n",
       "    -0.021928953006863594,\n",
       "    0.0028496314771473408,\n",
       "    -0.003159442450851202,\n",
       "    -0.023275135084986687,\n",
       "    0.0250113345682621,\n",
       "    0.008108554407954216,\n",
       "    -0.006353483069688082,\n",
       "    -0.0004615711222868413,\n",
       "    0.002469051629304886,\n",
       "    -0.006818985566496849,\n",
       "    -0.03583112731575966,\n",
       "    0.014644463546574116,\n",
       "    0.03203161805868149,\n",
       "    0.004478890914469957,\n",
       "    -0.0020412923768162727,\n",
       "    0.005463366396725178,\n",
       "    0.006149039138108492,\n",
       "    -0.019500790163874626,\n",
       "    -0.011341910809278488,\n",
       "    0.007102061994373798,\n",
       "    0.025892015546560287,\n",
       "    -0.0026436150074005127,\n",
       "    -0.021614423021674156,\n",
       "    -0.01655679941177368,\n",
       "    -0.013939918950200081,\n",
       "    0.03281165286898613,\n",
       "    0.00748578691855073,\n",
       "    -0.009467318654060364,\n",
       "    -0.0160283911973238,\n",
       "    -0.023879030719399452,\n",
       "    -0.009605711326003075,\n",
       "    0.003283681347966194,\n",
       "    -0.0033025529701262712,\n",
       "    0.031226426362991333,\n",
       "    -0.01378894504159689,\n",
       "    -0.0018132588593289256,\n",
       "    -0.00684414803981781,\n",
       "    -0.03731570392847061,\n",
       "    0.0015867981128394604,\n",
       "    0.001722045592032373,\n",
       "    -0.030723178759217262,\n",
       "    -0.04242365434765816,\n",
       "    -0.015990646556019783,\n",
       "    0.01960143819451332,\n",
       "    0.02244477905333042,\n",
       "    -0.013185050338506699,\n",
       "    -0.008473407477140427,\n",
       "    -0.01968950778245926,\n",
       "    0.012920845299959183,\n",
       "    -0.019752413034439087,\n",
       "    0.02462131902575493,\n",
       "    0.01522319670766592,\n",
       "    0.021413125097751617,\n",
       "    -0.005491673946380615,\n",
       "    0.017525548115372658,\n",
       "    0.006303158588707447,\n",
       "    -0.03256002813577652,\n",
       "    0.014657044783234596,\n",
       "    0.014015406370162964,\n",
       "    -0.0313774012029171,\n",
       "    0.018330741673707962,\n",
       "    0.015399333089590073,\n",
       "    0.009700070135295391,\n",
       "    -0.005887980572879314,\n",
       "    -0.011090287938714027,\n",
       "    0.0037617653142660856,\n",
       "    0.0091527896001935,\n",
       "    -0.0015364735154435039,\n",
       "    -0.00814000703394413,\n",
       "    -0.014795437455177307,\n",
       "    0.016267433762550354,\n",
       "    0.015877416357398033,\n",
       "    0.009530224837362766,\n",
       "    0.018116863444447517,\n",
       "    -0.0015545588685199618,\n",
       "    0.005463366396725178,\n",
       "    0.010826083831489086,\n",
       "    0.005582887213677168,\n",
       "    -0.021299894899129868,\n",
       "    -0.008158878423273563,\n",
       "    -0.011945806443691254,\n",
       "    -0.017500385642051697,\n",
       "    0.02123698964715004,\n",
       "    -0.0008531595231033862,\n",
       "    -0.0077059571631252766,\n",
       "    0.021639585494995117,\n",
       "    -0.031100613996386528,\n",
       "    -0.024961011484265327,\n",
       "    0.014317354187369347,\n",
       "    -0.003551030997186899,\n",
       "    0.001152748242020607,\n",
       "    0.009498771280050278,\n",
       "    0.011052544228732586,\n",
       "    0.012210010550916195,\n",
       "    0.012430180795490742,\n",
       "    0.005545143969357014,\n",
       "    -0.002649905625730753,\n",
       "    -0.010385743342339993,\n",
       "    -0.014216704294085503,\n",
       "    -0.025388769805431366,\n",
       "    -0.019513370469212532,\n",
       "    -0.0032994078937917948,\n",
       "    0.0054570757783949375,\n",
       "    -0.0068315668031573296,\n",
       "    -0.013298280537128448,\n",
       "    -0.02264607883989811,\n",
       "    -0.004277592524886131,\n",
       "    -0.04103972762823105,\n",
       "    -0.016091296449303627,\n",
       "    -0.007070608902722597,\n",
       "    -0.02033114619553089,\n",
       "    0.0029660072177648544,\n",
       "    0.024747131392359734,\n",
       "    0.002612162148579955,\n",
       "    0.018833989277482033,\n",
       "    0.0014963711146265268,\n",
       "    -0.006337756756693125,\n",
       "    -0.010580751113593578,\n",
       "    0.003384330542758107,\n",
       "    0.00619621854275465,\n",
       "    -0.02228122390806675,\n",
       "    0.02312416210770607,\n",
       "    -0.005611194763332605,\n",
       "    -0.02002919837832451,\n",
       "    -0.0019374977564439178,\n",
       "    0.016179364174604416,\n",
       "    0.016229689121246338,\n",
       "    -0.012109361588954926,\n",
       "    0.01948820799589157,\n",
       "    -0.019890805706381798,\n",
       "    0.042599789798259735,\n",
       "    -0.004705351777374744,\n",
       "    -0.0017361993668600917,\n",
       "    0.009700070135295391,\n",
       "    0.004595266655087471,\n",
       "    0.01160611491650343,\n",
       "    -0.005013590212911367,\n",
       "    -0.012725837528705597,\n",
       "    0.01139223575592041,\n",
       "    0.005063914693892002,\n",
       "    -0.01721101999282837,\n",
       "    0.016116458922624588,\n",
       "    0.0045826854184269905,\n",
       "    0.007630470208823681,\n",
       "    0.010788340121507645,\n",
       "    -0.025124566629529,\n",
       "    -0.013637971132993698,\n",
       "    0.02469680644571781,\n",
       "    -0.015047061257064342,\n",
       "    0.013826688751578331,\n",
       "    -0.01357506588101387,\n",
       "    -0.0012313805054873228,\n",
       "    0.019299490377306938,\n",
       "    0.025892015546560287,\n",
       "    0.0020208479836583138,\n",
       "    -0.00957425870001316,\n",
       "    -0.008246947079896927,\n",
       "    -0.011612406000494957,\n",
       "    0.000830356206279248,\n",
       "    0.039504826068878174,\n",
       "    -0.03258518874645233,\n",
       "    -0.003082382958382368,\n",
       "    -0.004032260272651911,\n",
       "    0.012637769803404808,\n",
       "    -0.01636808179318905,\n",
       "    0.00812742579728365,\n",
       "    -0.004831163212656975,\n",
       "    -0.007825477980077267,\n",
       "    -0.021060852333903313,\n",
       "    0.012128232978284359,\n",
       "    0.0123924370855093,\n",
       "    -2.6636662369128317e-05,\n",
       "    0.010706562548875809,\n",
       "    -0.034069765359163284,\n",
       "    -0.0006204081582836807,\n",
       "    -0.005589177832007408,\n",
       "    -0.012555992230772972,\n",
       "    -0.007976451888680458,\n",
       "    -0.023426109924912453,\n",
       "    -0.032459378242492676,\n",
       "    0.001942215720191598,\n",
       "    -0.001375277410261333,\n",
       "    -0.013424091972410679,\n",
       "    -0.029163116589188576,\n",
       "    0.02498617209494114,\n",
       "    0.0016229689354076982,\n",
       "    0.008699868805706501,\n",
       "    0.2353179156780243,\n",
       "    -0.031754832714796066,\n",
       "    -0.019676925614476204,\n",
       "    0.03565499186515808,\n",
       "    -0.003912738990038633,\n",
       "    -0.00892632920295,\n",
       "    -0.020381471142172813,\n",
       "    0.004478890914469957,\n",
       "    -0.014128636568784714,\n",
       "    0.009171661920845509,\n",
       "    -0.028206948190927505,\n",
       "    -0.01236727461218834,\n",
       "    0.01802879385650158,\n",
       "    -0.008372758515179157,\n",
       "    0.0060829883441329,\n",
       "    -0.005614340305328369,\n",
       "    -0.014468328095972538,\n",
       "    0.003516432596370578,\n",
       "    -0.002772571984678507,\n",
       "    -0.023161904886364937,\n",
       "    0.023614827543497086,\n",
       "    -7.43074415368028e-05,\n",
       "    -0.00509851286187768,\n",
       "    -0.014103474095463753,\n",
       "    0.019060449674725533,\n",
       "    -0.005711844190955162,\n",
       "    -0.016456149518489838,\n",
       "    -0.011329329572618008,\n",
       "    0.016443569213151932,\n",
       "    0.00032435788307338953,\n",
       "    -0.008467117324471474,\n",
       "    0.007297069765627384,\n",
       "    0.005384734366089106,\n",
       "    0.008693577721714973,\n",
       "    -0.013625390827655792,\n",
       "    0.003727167146280408,\n",
       "    0.019739830866456032,\n",
       "    -0.01921142265200615,\n",
       "    0.02996831014752388,\n",
       "    0.002896810881793499,\n",
       "    0.019626600667834282,\n",
       "    -0.004202105570584536,\n",
       "    -0.004205251112580299,\n",
       "    -0.0001519567595096305,\n",
       "    0.006756079848855734,\n",
       "    -0.01689649000763893,\n",
       "    ...],\n",
       "   'tagline': 'Everything is connected',\n",
       "   'title': 'Cloud Atlas',\n",
       "   'released': 2012}}]"
      ]
     },
     "execution_count": 22,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher = \"\"\"\n",
    "  MATCH (cloudAtlas:Movie {title:\"Cloud Atlas\"}) \n",
    "  RETURN cloudAtlas\n",
    "  \"\"\"\n",
    "kg.query(cypher)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "3f6debaf-f237-4b75-b18c-5ff56ccca780",
   "metadata": {},
   "source": [
    "- Return only the `released` property of the matched `Movie` node"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "id": "2c9d8fc2-4fc7-4e85-8ced-e3f0236e6b2f",
   "metadata": {
    "height": 98
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'cloudAtlas.released': 2012}]"
      ]
     },
     "execution_count": 23,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher = \"\"\"\n",
    "  MATCH (cloudAtlas:Movie {title:\"Cloud Atlas\"}) \n",
    "  RETURN cloudAtlas.released\n",
    "  \"\"\"\n",
    "kg.query(cypher)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "00e73a39-882c-4060-926e-deb484a4358f",
   "metadata": {},
   "source": [
    "- Return two properties"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "id": "64ad1276-c1cc-49d6-b7e9-d7126a37fabc",
   "metadata": {
    "height": 98
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'cloudAtlas.released': 2012,\n",
       "  'cloudAtlas.tagline': 'Everything is connected'}]"
      ]
     },
     "execution_count": 24,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher = \"\"\"\n",
    "  MATCH (cloudAtlas:Movie {title:\"Cloud Atlas\"}) \n",
    "  RETURN cloudAtlas.released, cloudAtlas.tagline\n",
    "  \"\"\"\n",
    "kg.query(cypher)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "689be729-367a-408b-b4e5-43d2a3d69744",
   "metadata": {},
   "source": [
    "### Cypher patterns with conditional matching"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "id": "fc7b4d4d-764e-4b83-ae7c-0f7717de85f2",
   "metadata": {
    "height": 132
   },
   "outputs": [],
   "source": [
    "cypher = \"\"\"\n",
    "  MATCH (nineties:Movie) \n",
    "  WHERE nineties.released >= 1990 \n",
    "    AND nineties.released < 2000 \n",
    "  RETURN nineties.title\n",
    "  \"\"\"\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "id": "c52524e8-c4b2-443a-9e4b-01c50f0be352",
   "metadata": {
    "height": 30
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'nineties.title': 'The Matrix'},\n",
       " {'nineties.title': \"The Devil's Advocate\"},\n",
       " {'nineties.title': 'A Few Good Men'},\n",
       " {'nineties.title': 'As Good as It Gets'},\n",
       " {'nineties.title': 'What Dreams May Come'},\n",
       " {'nineties.title': 'Snow Falling on Cedars'},\n",
       " {'nineties.title': \"You've Got Mail\"},\n",
       " {'nineties.title': 'Sleepless in Seattle'},\n",
       " {'nineties.title': 'Joe Versus the Volcano'},\n",
       " {'nineties.title': 'When Harry Met Sally'},\n",
       " {'nineties.title': 'That Thing You Do'},\n",
       " {'nineties.title': 'The Birdcage'},\n",
       " {'nineties.title': 'Unforgiven'},\n",
       " {'nineties.title': 'Johnny Mnemonic'},\n",
       " {'nineties.title': 'The Green Mile'},\n",
       " {'nineties.title': 'Hoffa'},\n",
       " {'nineties.title': 'Apollo 13'},\n",
       " {'nineties.title': 'Twister'},\n",
       " {'nineties.title': 'Bicentennial Man'},\n",
       " {'nineties.title': 'A League of Their Own'}]"
      ]
     },
     "execution_count": 26,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "kg.query(cypher)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "d176b9d2-ec33-423a-b3de-e9bc87810fe7",
   "metadata": {},
   "source": [
    "### Pattern matching with multiple nodes"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "id": "dd8ae45b-c131-4e39-a937-704855cbdd74",
   "metadata": {
    "height": 98
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'actor.name': 'Hugo Weaving', 'movie.title': 'The Matrix'},\n",
       " {'actor.name': 'Laurence Fishburne', 'movie.title': 'The Matrix'},\n",
       " {'actor.name': 'Carrie-Anne Moss', 'movie.title': 'The Matrix'},\n",
       " {'actor.name': 'Keanu Reeves', 'movie.title': 'The Matrix'},\n",
       " {'actor.name': 'Hugo Weaving', 'movie.title': 'The Matrix Reloaded'},\n",
       " {'actor.name': 'Laurence Fishburne', 'movie.title': 'The Matrix Reloaded'},\n",
       " {'actor.name': 'Carrie-Anne Moss', 'movie.title': 'The Matrix Reloaded'},\n",
       " {'actor.name': 'Keanu Reeves', 'movie.title': 'The Matrix Reloaded'},\n",
       " {'actor.name': 'Hugo Weaving', 'movie.title': 'The Matrix Revolutions'},\n",
       " {'actor.name': 'Laurence Fishburne', 'movie.title': 'The Matrix Revolutions'}]"
      ]
     },
     "execution_count": 27,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher = \"\"\"\n",
    "  MATCH (actor:Person)-[:ACTED_IN]->(movie:Movie) \n",
    "  RETURN actor.name, movie.title LIMIT 10\n",
    "  \"\"\"\n",
    "kg.query(cypher)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "id": "e79dd7e8-a778-467e-b6d9-ba6af8eee5bf",
   "metadata": {
    "height": 98
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'tom.name': 'Tom Hanks', 'tomHanksMovies.title': 'Apollo 13'},\n",
       " {'tom.name': 'Tom Hanks', 'tomHanksMovies.title': \"You've Got Mail\"},\n",
       " {'tom.name': 'Tom Hanks', 'tomHanksMovies.title': 'A League of Their Own'},\n",
       " {'tom.name': 'Tom Hanks', 'tomHanksMovies.title': 'Joe Versus the Volcano'},\n",
       " {'tom.name': 'Tom Hanks', 'tomHanksMovies.title': 'That Thing You Do'},\n",
       " {'tom.name': 'Tom Hanks', 'tomHanksMovies.title': 'The Da Vinci Code'},\n",
       " {'tom.name': 'Tom Hanks', 'tomHanksMovies.title': 'Cloud Atlas'},\n",
       " {'tom.name': 'Tom Hanks', 'tomHanksMovies.title': 'Cast Away'},\n",
       " {'tom.name': 'Tom Hanks', 'tomHanksMovies.title': 'The Green Mile'},\n",
       " {'tom.name': 'Tom Hanks', 'tomHanksMovies.title': 'Sleepless in Seattle'},\n",
       " {'tom.name': 'Tom Hanks', 'tomHanksMovies.title': 'The Polar Express'},\n",
       " {'tom.name': 'Tom Hanks', 'tomHanksMovies.title': \"Charlie Wilson's War\"}]"
      ]
     },
     "execution_count": 28,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher = \"\"\"\n",
    "  MATCH (tom:Person {name: \"Tom Hanks\"})-[:ACTED_IN]->(tomHanksMovies:Movie) \n",
    "  RETURN tom.name,tomHanksMovies.title\n",
    "  \"\"\"\n",
    "kg.query(cypher)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "id": "004147cc-14f4-43eb-86ff-d22e11a1d0d2",
   "metadata": {
    "height": 98
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'coActors.name': 'Ed Harris', 'm.title': 'Apollo 13'},\n",
       " {'coActors.name': 'Gary Sinise', 'm.title': 'Apollo 13'},\n",
       " {'coActors.name': 'Kevin Bacon', 'm.title': 'Apollo 13'},\n",
       " {'coActors.name': 'Bill Paxton', 'm.title': 'Apollo 13'},\n",
       " {'coActors.name': 'Parker Posey', 'm.title': \"You've Got Mail\"},\n",
       " {'coActors.name': 'Greg Kinnear', 'm.title': \"You've Got Mail\"},\n",
       " {'coActors.name': 'Meg Ryan', 'm.title': \"You've Got Mail\"},\n",
       " {'coActors.name': 'Steve Zahn', 'm.title': \"You've Got Mail\"},\n",
       " {'coActors.name': 'Dave Chappelle', 'm.title': \"You've Got Mail\"},\n",
       " {'coActors.name': 'Madonna', 'm.title': 'A League of Their Own'},\n",
       " {'coActors.name': \"Rosie O'Donnell\", 'm.title': 'A League of Their Own'},\n",
       " {'coActors.name': 'Geena Davis', 'm.title': 'A League of Their Own'},\n",
       " {'coActors.name': 'Bill Paxton', 'm.title': 'A League of Their Own'},\n",
       " {'coActors.name': 'Lori Petty', 'm.title': 'A League of Their Own'},\n",
       " {'coActors.name': 'Nathan Lane', 'm.title': 'Joe Versus the Volcano'},\n",
       " {'coActors.name': 'Meg Ryan', 'm.title': 'Joe Versus the Volcano'},\n",
       " {'coActors.name': 'Liv Tyler', 'm.title': 'That Thing You Do'},\n",
       " {'coActors.name': 'Charlize Theron', 'm.title': 'That Thing You Do'},\n",
       " {'coActors.name': 'Ian McKellen', 'm.title': 'The Da Vinci Code'},\n",
       " {'coActors.name': 'Audrey Tautou', 'm.title': 'The Da Vinci Code'},\n",
       " {'coActors.name': 'Paul Bettany', 'm.title': 'The Da Vinci Code'},\n",
       " {'coActors.name': 'Jim Broadbent', 'm.title': 'Cloud Atlas'},\n",
       " {'coActors.name': 'Halle Berry', 'm.title': 'Cloud Atlas'},\n",
       " {'coActors.name': 'Hugo Weaving', 'm.title': 'Cloud Atlas'},\n",
       " {'coActors.name': 'Helen Hunt', 'm.title': 'Cast Away'},\n",
       " {'coActors.name': 'Sam Rockwell', 'm.title': 'The Green Mile'},\n",
       " {'coActors.name': 'Bonnie Hunt', 'm.title': 'The Green Mile'},\n",
       " {'coActors.name': 'Patricia Clarkson', 'm.title': 'The Green Mile'},\n",
       " {'coActors.name': 'James Cromwell', 'm.title': 'The Green Mile'},\n",
       " {'coActors.name': 'Michael Clarke Duncan', 'm.title': 'The Green Mile'},\n",
       " {'coActors.name': 'David Morse', 'm.title': 'The Green Mile'},\n",
       " {'coActors.name': 'Gary Sinise', 'm.title': 'The Green Mile'},\n",
       " {'coActors.name': 'Meg Ryan', 'm.title': 'Sleepless in Seattle'},\n",
       " {'coActors.name': 'Victor Garber', 'm.title': 'Sleepless in Seattle'},\n",
       " {'coActors.name': 'Bill Pullman', 'm.title': 'Sleepless in Seattle'},\n",
       " {'coActors.name': 'Rita Wilson', 'm.title': 'Sleepless in Seattle'},\n",
       " {'coActors.name': \"Rosie O'Donnell\", 'm.title': 'Sleepless in Seattle'},\n",
       " {'coActors.name': 'Julia Roberts', 'm.title': \"Charlie Wilson's War\"},\n",
       " {'coActors.name': 'Philip Seymour Hoffman',\n",
       "  'm.title': \"Charlie Wilson's War\"}]"
      ]
     },
     "execution_count": 29,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher = \"\"\"\n",
    "  MATCH (tom:Person {name:\"Tom Hanks\"})-[:ACTED_IN]->(m)<-[:ACTED_IN]-(coActors) \n",
    "  RETURN coActors.name, m.title\n",
    "  \"\"\"\n",
    "kg.query(cypher)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "2ad3f683-d334-4c4e-b274-9789a70b9662",
   "metadata": {},
   "source": [
    "### Delete data from the graph"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "id": "5064cab8-b5d6-4f1c-b5ef-f154f5c10b2b",
   "metadata": {
    "height": 98
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 30,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher = \"\"\"\n",
    "MATCH (emil:Person {name:\"Emil Eifrem\"})-[actedIn:ACTED_IN]->(movie:Movie)\n",
    "RETURN emil.name, movie.title\n",
    "\"\"\"\n",
    "kg.query(cypher)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "id": "648d12d1-0966-46ff-ad77-080eae553c3a",
   "metadata": {
    "height": 98
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 31,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher = \"\"\"\n",
    "MATCH (emil:Person {name:\"Emil Eifrem\"})-[actedIn:ACTED_IN]->(movie:Movie)\n",
    "DELETE actedIn\n",
    "\"\"\"\n",
    "kg.query(cypher)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "109de94e-3526-4dad-9a62-1beb6c5dad2d",
   "metadata": {},
   "source": [
    "### Adding data to the graph"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "id": "ed1665da-b9ec-4b81-9e1f-de19af49d0d8",
   "metadata": {
    "height": 115
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'andreas': {'name': 'Andreas'}}]"
      ]
     },
     "execution_count": 32,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher = \"\"\"\n",
    "CREATE (andreas:Person {name:\"Andreas\"})\n",
    "RETURN andreas\n",
    "\"\"\"\n",
    "\n",
    "kg.query(cypher)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "id": "1a0b9bb9-4491-45e2-9a4d-2306ea0a2bd8",
   "metadata": {
    "height": 115
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'andreas': {'name': 'Andreas'},\n",
       "  'hasRelationship': ({'name': 'Andreas'},\n",
       "   'WORKS_WITH',\n",
       "   {'born': 1978, 'name': 'Emil Eifrem'}),\n",
       "  'emil': {'born': 1978, 'name': 'Emil Eifrem'}},\n",
       " {'andreas': {'name': 'Andreas'},\n",
       "  'hasRelationship': ({'name': 'Andreas'},\n",
       "   'WORKS_WITH',\n",
       "   {'born': 1978, 'name': 'Emil Eifrem'}),\n",
       "  'emil': {'born': 1978, 'name': 'Emil Eifrem'}},\n",
       " {'andreas': {'name': 'Andreas'},\n",
       "  'hasRelationship': ({'name': 'Andreas'},\n",
       "   'WORKS_WITH',\n",
       "   {'born': 1978, 'name': 'Emil Eifrem'}),\n",
       "  'emil': {'born': 1978, 'name': 'Emil Eifrem'}},\n",
       " {'andreas': {'name': 'Andreas'},\n",
       "  'hasRelationship': ({'name': 'Andreas'},\n",
       "   'WORKS_WITH',\n",
       "   {'born': 1978, 'name': 'Emil Eifrem'}),\n",
       "  'emil': {'born': 1978, 'name': 'Emil Eifrem'}}]"
      ]
     },
     "execution_count": 33,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher = \"\"\"\n",
    "MATCH (andreas:Person {name:\"Andreas\"}), (emil:Person {name:\"Emil Eifrem\"})\n",
    "MERGE (andreas)-[hasRelationship:WORKS_WITH]->(emil)\n",
    "RETURN andreas, hasRelationship, emil\n",
    "\"\"\"\n",
    "kg.query(cypher)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "demo_of_graphs_for_RAG",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.13"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
